app/controllers/comments_controller.rb

SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = 6 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "score", "gpa", "hard", "lecture_id", "created_at", "updated_at") VALUES ('김연아', '실제 상담 현장에서 일하고 계신 분이어서 수업시간에 생생한 사례들에 대해서 많이 말씀해주십니다. 실제 상담 장면에서의 상담 자체가 체계적인 이론보다는 직관과 통찰이 중요하다보니, 이런 부분을 강조해서 말씀하십니다. 실제로 이런 상담과정에서의 직관과 통찰, 전반적인 이해를 얻기에는 좋은 수업 방식이었다고 생각합니다. 또 교수님께서 상담에 대한 자기확신(?) 자부심(?)이 큰 만큼 강조하시고자 하는 부분에 대해서는 열정있으셨던 것 같습니다. 비록 마지막 기말이 조금 지엽적이고 단답형이라 학점이 어떻게 나온건진 잘 모르겠지만 전반적으로는 좋은 강의였다고 생각합니다. 진짜 실제 상담에 대해서 생각해 볼 수 있는 수업
SELECT "comments".* FROM "comments" WHERE ("comments".lecture_id = 8)
UPDATE "lectures" SET "gpa" = 2.6666666666666665, "hard" = 2.8333333333333335, "score" = 2.6666666666666665, "updated_at" = '2014-02-25 03:41:20.136581' WHERE "lectures"."id" = 8
---
  def create
    @lecture = Lecture.find(params[:lecture_id])
    @comment = @lecture.comments.create(params[:comment])

	@count = 0
	@gpa = 0
	@hard = 0
	@score = 0

    @lecture.comments.each do |comment|
      @gpa = @gpa.to_f + comment.gpa
      @hard = @hard.to_f + comment.hard
      @score = @score.to_f + comment.score
	  @count = @count.to_i + 1
    end

	@lecture.gpa = @gpa.to_f / @count
	@lecture.hard = @hard.to_f / @count
	@lecture.score = @score.to_f / @count
    @lecture.save

SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = 8 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 6 AND ("comments".lecture_id = 8) LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 6
---
  def destroy
    @lecture = Lecture.find(params[:lecture_id])
    @comment = @lecture.comments.find(params[:id])
    @comment.destroy